DSU/src/Reports/ИсторияРасходовПоСтатье/ИсторияРасходовПоСтатье.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИсторияРасходовПоСтатье</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
</mdclass:Report>

DSU/src/Reports/ИсторияРасходовПоСтатье/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Результат = СформироватьОтчетСКД();
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетСКД() Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
	
	ПараметрыДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	УстановитьПараметрДанных(ПараметрыДанных, "НачалоПериода", НачалоПериода);
	УстановитьПараметрДанных(ПараметрыДанных, "КонецПериода", КонецПериода);
	УстановитьПараметрДанных(ПараметрыДанных, "СтатьяДДС", СтатьяДДС);

	СхемаКомпоновки = Отчеты.ИсторияРасходовПоСтатье.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Настройки.Порядок.Элементы.Очистить();
	
	ИмяПоляПорядка = "Документ";
	ПолеПорядка = Новый ПолеКомпоновкиДанных(ИмяПоляПорядка);

	ЭлементПорядка                     	=  Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Использование      	= Истина;
	ЭлементПорядка.Поле              	= ПолеПорядка;
	ЭлементПорядка.ТипУпорядочивания 	= НаправлениеСортировкиКомпоновкиДанных.Возр;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, Настройки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода  = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(табДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТабДок;
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонецПериода = ТекущаяДатаСеанса();
	НачалоПериода = ДобавитьМесяц(КонецПериода, -6);
	
	ВидСортировки.Добавить("Сумма");
	ВидСортировки.Добавить("ДатаДокумента");
	
КонецПроцедуры
